"Mac QQ" = "QQ";
"Conversation with" = "Conversation - %@";
"Login Failed" = "Login Failed";
"Sign in again" = "Sign in again";
"No Space In Detail" = "Please release %luM more space for the message record update";
"Msg Convert Error" = "Msg Update Fail";
"Decrypt Fail" = "Error! Please verify your message file matches the QQ number";
"Corrupted History" = "Your message history data is corrupted, please delete it and re-login.";
"Delete Converting File" = "Converting File can not be deleted";
"OK" = "OK";
"Cancel" = "Cancel";
"Sign In" = "Sign In";
"Click here" = "Click here";
"Offline Alerts" = "Offline Alerts";
"Change Pwd" = "change your password";
"Click OK to Terminate" = "Press OK to quit the QQ.";
"Add Buddy Failed"="Failed to add the contact";
"Re-select the location" = "Re-select the location";
"Not Specified"="Not Specified";
"Male"="Male";
"Female"="Female";
"Online" = "Online";
"Busy" = "Busy";
"Away" = "Away";
"Invisible" = "Invisible";
"Offline" = "Offline";
"Need Validate Code! Not supported by current version" = "Need Validate Code! Not supported by current version";
"Faild" = "Failed";
"Error" = "Error";
"Network Setting" = "Network Setting";
"Proxy Type" = "Type:";
"IP Address" = "IP:";
"Port" = "Port:";
"Username" = "Username:";
"Password" = "Password:";
"Domain" = "Domain:";
"Test Proxy" = "Test";
"Welcome to QQ" = "Welcome to QQ";
"Proxy Not Used" = "Proxy Not Used";
"HTTP Proxy" = "HTTP Proxy";
"SOCKS5 Proxy" = "SOCKS5 Proxy";
"Unknown" = "Unknown";
"Question 1" = "Question 1: ";
"Question 2" = "Question 2: ";
"Question 3" = "Question 3: ";
"This directory does not exit. Please specify another one." = "This directory does not exit. Please specify another one.";
"Notification" = "Notification";
"HotKeys Conflict, Please Reset." = "Please Reset the hot-keys.";
"HotKey Conflict With Default, Please Reset." = "Hot-key Conflict With Default, Please Reset.";
"Invalid Hotkey, Please reset." = "Invalid Hot-key, Please reset.";
"need  validate code! not support now!" = "need  validate code! not support now!";
"Finger Group Error!" = "No matching group found!";
"Owner has set Refuse you to add to the group" = "Owner has refused your request";
"You are already a member of the group" = "You are already a member of the group";
"QQ Account can't be NULL" = "QQ ID can't be NULL";
"qq account not valid" = "Invalid QQ ID. Please enter it again";
"Group Number not Invalid" = "Invalid group ID. Please enter it again";
"Add Contact Error!" = "Failed to add the contact";
"Can't add your self" = "You could not add yourself as a contact";
"This directory can't be wirtten. Please specify another one." = "This directory can't be written. Please specify another one.";
"Error when Add user" = "Failed to add the group member";
"Error opening URL" = "Failed to open the URL";
"Delete Contact" = "Delete contact";
"Fail to Connect Proxy Server" = "Fail to Connect Proxy Server";
"Connet Proxy Server Successfully" = "Connect Proxy Server Successfully";
"Are You sure you want delete " = "Are you sure to delete ";
"Are you sure to delete system messages?" = "Are you sure to delete system messages?";
"Are you sure to delete the message history with this contact?" = "Are you sure to delete the message history of this contact?(The synchronize message will be deleted too)";
"Are you sure to delete the message history of these contacts?" = "Are you sure to delete the message history of these contacts?(The synchronize message will be deleted too)";
"Are you sure to delete the message history with this group?" = "Are you sure to delete the message history of this group?(The synchronize message will be deleted too)";
"Are you sure to delete the message history with this discussion group?" = "Are you sure to delete the message history of this discussion group?(The synchronize message will be deleted too)";
"Are you sure to delete selected message history?" = "Are you sure to delete selected message history?(The synchronize message will be deleted too)";
"Error when Rename friend" = "Failed to edit the display name";
"Also delete my self from his/her friend list" = "Also delete myself from his/her contact list";
"Your network connection is broken" = " Connection is broken";
"Waiting resignin" = "Connecting";
"Add as friend" = "Add as a contact";
"accepted your request" = "approved your request";
" accepted your request" = " approved your request";
"added you as a contact" = "added you as a contact";
" added you as a contact" = " added you as a contact";
"declined your request" = "declined your request";
" declined your request" = " declined your request";
"accepted your request and add you as a contact" = "approved your request and added you as a contact";
" accepted your request and add you as a contact" = " approved your request and added you as a contact";
"User %lu %@" = "User %lu %@";
"%lu want to add you as a QQ contact. \n %@" = "%lu requests to add you as a QQ contact. \n %@";
"Not support of Picture" = "Custom emotions/pictures are not supported in current version.";
"Login Timeout" = "Login Timeout";
"Login ExceedQQNum" = "You are not allowed to sign in to QQ anymore.";
"Server request new encrypt method to login " = "Server requests new encrypt method to sign in ";
"China" = "China";
"Please enter a valid ID" = "Please enter a valid ID";
"Please input your password" = "Please enter your password";
"SearchContactTip" = "Find a contact...";
"SearchContactOperTip" = "Enter QQ number, name/nickname, spell/pinyin to find the contact or group";
"The contact invite you to audio communication, but this version does not support yet" = "The contact starts an audio conversation. However, current version does not support this feature";
"The contact invite you to video communication, but this version does not support yet" = "The contact starts a video conversation. However, current version does not support this feature";
"The contact try to send you a file, but this version does not support to receive" = "The contact tries to send you a file. However, current version does not support this feature";
"The contact try to make long connection with you, but this version does not support" = "The contact sends you a request for long connection. However, current version does not support this feature";
"The contact ask you for remote help, but this version does not support to receive" = "The contact asks you for remote help. However, current version does not support this feature";
"Search contacts" = "Search/Add contact";
"Add Buddy/Group" = "Add Buddy/Group";
"Open my mailbox" = "Open mailbox";
"Open message manager" = "Open message manager";
"open QQ for Mac Blog" = "Open Q-Zone";
"Settings" = "Preferences";
"View message history" = "Message history";
"Send pictures" = "Send pictures";
"Screen shots" = "Screen shots";
"Send a Nudge to your contact" = "Send a Nudge to your contact";
"Contacts" = "Contacts";
"Groups" = "Groups";
"Recent contacts" = "Recent Contacts";
"Select an emoticon" = "Emotions";
"Set font color and format" = "Font color and format";
"Show group list" = "Display group members";
"Hide group list" = "Hide group members";
"Show discussion list" = "Display discussion members";
"Hide discussion list" = "Hide discussion members";
"Discussion(%@)(%lu)" = "Discussion(%@)(%lu)";
"NFCDiscussion(%@)" = "NFCDiscussion(%@)";
"CreateDiscuss" = "Create Discussion Group";
"You can't create discussions while offline" = "You can't create discussions while offline.";
"Subject - %@" = "Subject - %@";
" Want to join group: " = " requests to join the group: ";
"Notice: Links in the message are possibly unsafe. We have removed them. Please click here " = "Note: The URL in the message is possibly unsafe and is blocked by ";
"Security center " = "QQ Security Center ";
"http://safe.qq.com/cgi-bin/url_main_web?" = "http://safe.qq.com/cgi-bin/url_main_web?";
"Please click here to block the link contained in the message you receive. " = "Please click here to ";
"View details" = "View details";
"http://safe.qq.com/cgi-bin/url_detail?clientuin=%lu&clientkey=%s&urlid=%lu" = "http://safe.qq.com/cgi-bin/url_detail?clientuin=%lu&clientkey=%@&urlid=%lu";
"Connection Broken" = "Connection Broken";
"My Friends" = "Contacts";
"My Device" = "Device";
"My Groups" = "Groups";
"My Discuss" = "Discussion Groups";
"System Message" = "System Messages";
"Delete" = "Delete";
"Delete message" = "Delete message";
"Refresh" = "Refresh";
"Refresh Display" = "Refresh Display";
"Roam configure" = "Message Setting";
"Request&Notice" = "Request&Notice";
"Group %lu Admin %lu passed you request" = "Group %lu's administrator %lu approved  your request";
"Group %lu Admin %lu reject you request" = "Group %lu's administrator %lu rejected  your request";
"\nAdditonal message:%@" = "\nAdditional message:%@";
"%@ requests to add you as a contact" = "%@ requests to add you as a contact.";
"Messages" = "Messages";
"Block Group" = "Receive without Alert";
"QQ Mail" = "QQ Mail";
"QZone" = "Q-Zone";
"You have been removed by administrator %@ from group %@" = "You have been removed by administrator %@ from group %@";
"AddBuddy_HasBeenYourBuddy" ="The contact is already in your contact list";
"AddBuddy_UnkownError" = "Unknown error";
"Request_Expired" = "Sorry, this request has expired, unable to be operated.";
"CF_TempSession_AddBuddyFail" = "Failed to add the contact. Please try it again!";

"Failed to load verification info" = "Failed to load verification info";
"Load verification code timeout" = "Load verification code timeout";
"Verification time out" = "Verification time out";
"Verification code error" = "Verification code error";
"Unknown network error" = "Unknown network error";
"Failed to be verified" = "Failed to be verified";
"Wrong answers." = "Wrong answers.";
"Your request is declined" = "Your request is declined";
"You are offline. Failed to change the profile" = "You are offline. Failed to change the profile";

"Move Contact Failed" = "Move Contact Failed";
"Move Group Failed" = "Move Group Failed";
"Modify Personal profiles" = "Modify Personal profiles";
"The selected group will be deleted. Contacts in the group will be moved to the default group. Are you sure to delete this group?"= "The selected group will be deleted. Contacts in the group will be moved to the default group. Are you sure to delete this group?";
"Delete group" = "Delete group";
"The selected group will be deleted. Groups in the folder will be moved to the default folder. Are you sure to delete this folder?"="The selected group will be deleted. Groups in the folder will be moved to the default folder. Are you sure to delete this folder?";
"Age must be an integer between 1 and 119." = "Age must be an integer between 1 and 119";
"Email address is not correct." = "Email address is not correct";
"Failed to edit information." = "Failed to edit information.";
"Set group card timeout." = "Setting timeout.";
"Set group member timeout." = "Setting timeout.";
"Set group basic info timeout." = "Setting timeout.";
"Set group identity verification mode timeout." = "Setting timeout.";
"Set group message receiving mode timeout." = "Setting timeout.";
"Group settings - %@" = "Group settings - %@";
"Group settings" = "Group Settings";
"Group sharing" = "Group Sharing";
"You have quitted the group %@(%lu)" = "You have quitted the group %@(%lu)";
"Set group administrator timeout." = "Setting timeout.";
"Set group administrator failed." = "Set group administrator failed.";
"Cancel admin" = "Cancel admin";
"Grant admin" = "Grant admin";
"This operation will remove the contact from the group. Are you sure to continue?" = "This operation will remove the contact from the group. Are you sure to continue?";
"Are you sure to quit the group?" = "Are you sure to quit the group?";
"Date" = "Date";
"Folder Transfer Unsupported Tip" = "The contact has sent you a folder named \"%@\". But the current version is still unsupported.";
"Page: %@" = "Page: %@";
"Page: %lu" = "/%lu Page";
"IDS_GROUP_WANTJOIN_1" = "$1<$MEMNAME$$> requests to join the group $2<$GNAME$($GID$)$>$CRLF$ Additional Message: ($TIME$)$CRLF$$STRMSG$";
"IDS_GROUP_ADMINCANCELa" = "Your administrator title of group $2<$GNAME$($GID$)$> has been cancelled.";
"IDS_GROUP_ADMINCHANGEa" = "You are administrator of the group $2<$GNAME$($GID$)$>.";
"IDS_GROUP_SHARDHOLDERa" = "You have become premium membership of group $2<$GNAME$($GID$)$> .";
"IDS_GROUP_SHARDHOLDER_CANCELa" = "Your premium membership has expired in the group $2<$GNAME$($GID$)$> .";
"IDS_GROUP_ADMINCANCELb" = "$1<$MEMNAME$$>'s administrator title of group $2<$GNAME$($GID$)$> has been cancelled.";
"IDS_GROUP_ADMINCHANGEb" = "$1<$MEMNAME$$> has become administrator of group $2<$GNAME$($GID$)$>.";
"IDS_GROUP_SHARDHOLDERb" = "$1<$MEMNAME$$> has become a premium member of group $2<$GNAME$($GID$)$> .";
"IDS_GROUP_SHARDHOLDER_CANCELb" = "$1<$MEMNAME$$>'s premium membership has expired in the group $2<$GNAME$($GID$)$> .";
"IDS_GROUP_CREATORSHIFT_SELF_1" = "You have successfully handed over group $2<$GNAME$($GID$)$> to $1<$MEMNAME$$>.";
"IDS_GROUP_CREATORSHIFT_1" = "Owner $1<$MEMNAME$$> of group $2<$GNAME$($GID$)$> has handed over this group to you, and you are the group owner now.";
"IDS_GROUP_CREATORSHIFT_3" = "Owner $1<$MEMNAME$$> of group $2<$GNAME$($GID$)$> has handed over this group to $3<$MEMNAME$$>.";
"IDS_GROUP_MEMEXIT_SELF" = "You have quitted the group successfully.";
"IDS_GROUP_MEMEXIT_EXIT" = "$1<$MEMNAME$$> quitted the group $2<$GNAME$($GID$)$>.";
"IDS_GROUP_MEMEXIT_ADMIN" = "$1<$MEMNAME$$> has been removed by administrator $3<$ADMNAME$$> from group $2<$GNAME$($GID$)$>.";
"IDS_GROUP_MEMEXIT_ADMIN2" = "$1<$MEMNAME$$> has been removed by administrator $3<$ADMNAME$$> from group $2<$GNAME$($GID$)$>.";
"IDS_GROUP_DESTORY_SELF" = "You have dismissed the group $2<$GNAME$($GID$)$> successfully.";
"IDS_GROUP_DESTORY" = "Owner $1<$MEMNAME$$> of group $GROUP$ has dismissed this group.";
"IDS_GROUP_NEWGROUP" = "You have created the group $2<$GNAME$($GID$)$> successfully, invite your friends now.";
"IDS_GROUP_NEWGROUP_1" = "$1<$MEMNAME$$> created group $2<$GNAME$($GID$)$> , and owner added you into the group.";
"IDS_GROUP_NEWMEMBER_1" = "Administrator $1<$MEMNAME$$> of group $2<$GNAME$($GID$)$> has accepted your request.";
"IDS_GROUP_NEWMEMBER_INVITE_1" = "You have joined group $2<$GNAME$($GID$)$>, $1<$MEMNAME$$> invited you.";
"IDS_GROUP_ACCEPTJOIN_1" = "Administrator $1<$MEMNAME$$> of group $2<$GNAME$($GID$)$> has accepted your request.";
"IDS_GROUP_REJECTJOIN_1" = "Administrator $1<$MEMNAME$$> of the group $2<$GNAME$($GID$)$> has declined you to join the group. $DOT$Reason: $MSG$";

"AddBuddy_AskToBeAdded" = "%ls accepted your request and add you as a contact";
"AddBuddy_Addtional" = "Additional message:";
"AddBuddy_Accept" = "%ls accepted your request";
"AddBuddy_AddYou" = "%ls added you as a contact";
"AddBuddy_YouRequesWasDeclined" = "%ls declined your request";
"AddBuddy_AcceptAndAdd" = "%ls accepted your request and add you as a contact";

"CF_SEND_C2CMSG_FAILED" = "Network error, failed to send message from \"%ls\".";
"CF_C2CMSG_SEND_FAILED" = "Send Message Failed ";

"CF_EDITMSG_LARGE_MESSAGE" = "The content is too long. Please separate it into several parts and send again.";
"CF_PICTURE_OVERSIZE" = "The image in the message cannot be larger than 5MB. Please edit it and resend.";
"CF_PICTURE_OVERSIZE_PRECHECK" = "The image contained in the message is over 5M. Please send it as a file.";
"CF_SELF_OFFLINE" = "You can't send messages while offline.";
"CF_AUDIOINPUT_NOTFOUND" = "Audio InputDevice Not Found.";
"CF_AudioMsg_Running_VideoAudio" = "You are running Video/Audio Chat. You can't send voice message right now.";
"CF_SpliteButton_CloseTip" = "Hide Sidebar";
"CF_SpliteButton_OpenTip" = "Show Sidebar";

"AddMeValidateQuestion1" = "My email address?";
"AddMeValidateQuestion2" = "My car number?";
"AddMeValidateQuestion3" = "My phone number?";
"AddMeValidateQuestion4" = "My cell phone number?";
"AddMeValidateQuestion5" = "My real name?";
"AddMeValidateQuestion6" = "My company name?";

"QuesOrAnswerCantNull" = "You cannot leave the question or answer field blank.";

"Finger_TimeOut" = "Search timeout.";
"Finger_UnkownError" = "Unknown error.";
"ReadValidInfoTimeOut" = "Load verification code timeout";
"SaveSetTimeOut" = "Network timeout. Failed to save the settings";
"SaveSetFailed" = "Failed to save the settings.";
"Privacy" = "Privacy";
"General" = "General";
"AIOWindow" = "Chat window";
"Failed to send: the size of '%@' is over 4G" = "Failed to send offline file: the size of '%@' is over 4G.";
"Save As..." = "Save As...";
"Fail to save image" = "Failed to save the image file";
"Save Error" = "An error occurred";
"(Empty)" = "(Empty)";
"I Know" = "I Know";
"complete" = "complete";
"Please enter a display name:" = "Please enter a display name:";
"Edit display name" = "Edit display name";
"Please enter folder name:" = "Please enter folder name:";
"Please enter discussion title:" = "Please enter discussion title:";
"Rename Folder" = "Rename Folder";
"Insert Folder" = "Insert Folder";
"You are not online, please login then send video" = "You can't send video call while offline.";

"User are CRM, refused the video request" = "User are bussiness QQ, Can't get your video request.";
"User are CRM, refused the audio request" = "User are bussiness QQ, Can't get your audio request.";

"Cut" = "Cut";
"Copy" = "Copy";
"Paste" = "Paste";

"Receive with alert" = "Receive with alert";
"Auto pop-up messages" = "Auto pop-up messages";
"Only show message quantity" = "Only show message quantity";
"Receive without alert" = "Receive without alert";
"Block all group messages" = "Block all group messages";
"Alert new message" = "Alert new message";
"Do not alert new message" = "Do not alert new message";

"Big Icon" = "Big Icon";
"Small Icon" = "Small Icon";
"NewFeature" = "NewFeature";
"Refuse Reason" = "Reason: ";
"SignUpPage" = "http://en.emailreg.qq.com/";
"AccountPage" = "http://account.qq.com/cgi-bin/en/index#/";
"You can't send files while offline" = "You can't send files while offline.";
"Nudge is not available because you are offline." = "You can't send a Nudge while offline.";

"Send a request" = "wait for %@ to accept the request";
"Receive a request" = "%@ is request to send you a file";
"Send Files" = "Send Files";
"Send File" = "Send File";
"The full path of the file is too long, failed to send it" = "The full path of the file is too long, failed to send it";
"File name is too long, failed to send"  = "File name is too long, failed to send";
"Hide Files Drawer" = "Hide Files Drawer";
"Show Files Drawer" = "Show Files Drawer";
"Clean All the Finished Tasks" = "Clean All the Finished Tasks";
"Close Coversation Window" = "Close Conversation Window";
"File transferring will be stopped as the window closed. Are you sure to close it?" = "File transferring will be stopped as the window closed. Are you sure to close it?";
"Quit QQ" = "Quit QQ";
"You may not quit QQ when files are transferring." = "File transfer is not completed, are you sure to exit?";
"Change Account" = "Change Account";
"Are you sure to sign in with a different ID?" = "Are you sure to sign in with a different ID?";

"Ignore" = "Ignore";
"Show all" = "Show all";
"Main panel" = "Main panel";
"Show In Finder" = "Show In Finder";

"Are you sure to quit the Discuss?" = "Are you sure to quit the discussion?";
"members" = "members";
"Accept" = "Accept";
"Reject" = "Reject";
"invites you on a video talk" = "invites you on a video talk";
"Add Dicscussion Group Members" = "Add Discussion Group Members";
"Quit Dicscussion Group" = "Quit Discussion Group";
"Modify Discussion Title" = "Modify Discussion Title";
"Create New Discussion Failed" = "Failed to Create New Discussion";
"No more than 50 persons can be added fro each discussion group." = "Each discussion group limited members to 50 persons.";
"Reach the pepole limit." = "The number of group members has exceeded limit.";
"Exited discussions(%u)" = "Quitted discussions(%u)";
"Exited groups(%u)" = "Quitted groups(%u)";
"Exited discussions" = "Quitted discussions";
"Disband Group" = "Disband Group";
"Are you sure to disband the group?" = "Are you sure to disband the group?";

"This buddy has been your friend" = "This buddy has been your friend";
"Move to Block list" = "Move to Block list";
"Are you sure you want to move this contact to your Block list?" = "Are you sure you want to move this contact to your Block list?";
"Convert Tip" = "The message update will last %d minutes";
"Network error, could not quit the discussion!" = "Network error, could not quit the discussion!";
"Network error, could not create the discussion!" = "Network error, could not create the discussion!";

"Show the contact's chatting the window" = "Click to chat";
"Hide small window" = "Hide small window";
"Show small window" = "Show small window";
"Click to mute" = "Click to mute";
"Click to unmute" = "Click to unmute";
"Full-screen" = "Full-screen";
"Normal-screen" = "Normal-screen";
"End" = "End";
"start video chat" = "start video chat";
"start audio chat" = "start audio chat";
"start screen share" = "start screen share";
"Request failed" = "Request failed";
"The contact refused the request" = "The contact refused the request";
"The video equipment is on process" = "The video equipment is on process";
"The audio equipment is on process" = "The audio equipment is on process";
"You have cancelled the request" = "You have cancelled the request";
"You have cancelled the audio request" = "You have cancelled the request";
"Audio_You have cancelled the request" = "You have cancelled the request";
"The contact cancelled the request" = "The contact cancelled the request";
"Audio_The contact cancelled the request" = "The contact cancelled the request";
"The contact is busy now" = "The contact is busy now";
"is inviting you for a video chat" = "is inviting you for a video chat";
"Refuse" = "Refuse";
"Accept" = "Accept";
"voice-enabled chat" = "voice-enabled chat";
"Voice-enabled chat won’t send video information" = "Voice-enabled chat won’t send video information";
"You have refused the video chat request" = "You have refused the video chat request";
"Time out" = "Time out";
"You have hangged up it. It’s %u hour %u min %u sen total." = "It’s %u hour %u min %u sec total.";
"You have hangged up it. It’s %u min %u sen total." = "It’s %u min %u sec total.";
"You have hangged up it. It’s %u sen total." = "It’s %u sec total.";
"The contact has hangged up it. It’s %u hour %u min %u sen total." = "The contact has hanged up it,it’s %u hour %u min %u sec total.";
"The contact has hangged up it. It’s %u min %u sen total." = "The contact has hanged up it,it’s %u min %u sec total.";
"The contact has hangged up it. It’s %u sen total." = "The contact has hanged up it,it’s %u sec total.";

"Audio_You have hangged up it. It’s %u hour %u min %u sen total." =  "It’s %u hour %u min %u sec total.";
"Audio_You have hangged up it. It’s %u min %u sen total." =  "It’s %u min %u sec total.";
"Audio_You have hangged up it. It’s %u sen total." = "It’s %u sec total.";
"Audio_The contact has hangged up it. It’s %u hour %u min %u sen total." = "The contact has hanged up it,it’s %u hour %u min %u sec total.";
"Audio_The contact has hangged up it. It’s %u min %u sen total." = "The contact has hanged up it,it’s %u min %u sec total.";
"Audio_The contact has hangged up it. It’s %u sen total." = "The contact has hanged up it,it’s %u sec total.";

"You are on the video chat. Really want to quit it?" = "You are on the video chat. Really want to quit it?";
"Request conflicts. Please try again." = "Requests conflict. Please try again.";
"Audio_Request conflicts. Please try again." = "Requests conflict. Please try again.";
"The contact’s QQ version is too low." = "The contact’s current version is too low.";
"You are on a video chat" = "You are on a video chat";
"You are on a audio chat" = "You are on a audio chat";
"Prompt" = "Prompt";
"The contact refused the request" = "The contact refused the request";
"Audio_The contact refused the request" = "The contact refused the request";
"Connecting" = "Connecting";
"Waiting for the reply" = "Waiting for the reply";
"Transmission" = "Transmission";
"Find group ok button" = "OK";
"YES" = "YES";
"YES_OK" = "OK";
"NO" = "NO";
"Confirm" = "Confirm";
"is inviting you for an audio chat" = "is inviting you for a audio chat";

"Wrong number" = "Wrong number";
"Verification code is invalid" = "Verification code is invalid";
"You are not online" = "You are offline";

"Show in Contacts" = "Show in Contacts";

"Add to emotion" = "Add to emoticons";
"Emotion Manager" = "Emoticons";
"History Emotion" = "Recent Emoticons";
"System Emotion" = "Default";
"Customize Emotion" = "Favorite";
"History Emotion" = "Recent Emoticons";

"Redownload Picture" = "Refresh";

"Face Error 1" = "Emoticon addition exceeded limit";
"Face Error 2" = "File name contains special characters";
"Face Error 3" = "Failed to add Emoticon";
"Face Error 4" = "This emoticon already exists in the category";
"Face Error 5" = "Image is out of size";
"Face Error 6" = "The picture is corrupted, and can not be added to Emoicon list";

"as the using version of the contact is out-of-date, the video invitation has failed." = "as the current version of the contact is out-of-date, the video invitation has failed.";
"as the using version of the contact is out-of-date, the audio invitation has failed." = "as the current version of the contact is out-of-date, the audio invitation has failed.";
"Disconnected" = "Disconnected";

"Add contact" = "Add contact";
"Success to add a contact" = "Success to add a contact";
"Tips" = "Tips";
"Please add the contact first and then send messages." = "Please add the contact first and then send messages.";
"The contact is playing a recorded-video now" = "The contact is playing a recorded-video now";

"From:%@" = "From:%@";
"Founder: %@" = "Founder:%@";

"Edit profile" = "Edit profile";
"Change profile picture" = "Change profile picture";
"Change nickname" = "Change nickname";
"Change personal message" = "Change personal message";
"Change display name" = "Change display name";
"Failed to change the profile" = "Failed to change the profile";
"Failed to change the display name" = "Failed to change the display name";
"Failed to change the picture" = "Failed to change the picture";
"Network error." = "Network error.";
"Network error.Try it later" = "Network error.Try it later";
"Network timeout.Try it later" = "Network timeout.Try it later";
"System error." = "Network error.";
"edit personal message" = "edit personal message";
"edit description" = "edit description";

"QQ Token"="QQ令牌";
"Mobile Token"="手机令牌";
"PwdGuard Card"="密保卡";
"PwdGuard Mobile"="密保手机";
"QQ Token Tip"="请您使用QQ令牌，通过按钮获取%d位数字动态密码并填入下框中：";
"PwdGuard Mobile Tip"="请用该手机编辑短信“%@”发送到%@，请将收到的8位数字验证码填入下框中：";
"Mobile Token Tip"="请您运行手机上的手机令牌软件，将屏幕上显示的6位数字动态密码填入框中：";
"New QQ Token Tip"="请输入令牌上的动态密码。";
"New PwdGuard Mobile Tip"="1.请使用密保手机(%@)\n2.编辑短信 %@ \n发送到 %@ 以获取验证码";
"New Mobile Token Tip"="打开QQ安全中心手机版，将6位动态密码填入输入框。";
"Step Back" = "<Back";
"Other Check" = "Others";
"Need To Auth" = "Device Protection enabled";
"Get On" = "Get on";
"Scan QRCode" = "to scan QRCode";
"QQ Mobile" = "QQ Mobile";
"Scan OK" = "Scan successed，confirm login on mobile please";
"QRCode Invalid" = "QRCode has been invalid";
"QRCode Expired" = "QRCode failed";
"Login Request Expired"= "Login request expired";
"Login Request Failed" = "Login request failed";
"Request Failed" = "Request failed";
"ServerTime Format" = "%Y年%m月%d日 %H:%M:%S";
"Get EMPKPic Failed" = "密保卡坐标图片下载失败，请重新验证";
"Verify Failed" = "无法通过%@验证。";
"open Tencent Weibo" = "Open Tencent Weibo";


"Check for Updates…" = "Check for Updates…";
"Checking for updates…" = "Checking for updates…";
"Cancel" = "Cancel";
"An error occured" = "An error occurred";
"There is a problem checking updates for QQ, please retry later." = "There is a error checking updates for QQ, please retry later.";
"Retry" = "Retry" ;
"Fail to connect to update server" = "Fail to connect to update server";
"Connection timeout, Please your network, or retry later." = "Connection timeout, Please your network, or retry later.";
"You are already using the latest version." = "You are already using the latest version.";
"%@iscurrently the newest version available." = "%@iscurrently the newest version available.";
"Never Remind me updates from official site" = "Never Remind me updates from official site";
"You can choose to receive latest updates from official site, or only receive stable updates from App Store" = "You can choose to receive latest updates from official site, or only receive stable updates from App Store";
"Software Update" = "Software Update";
"A new version of QQ is available on official site." = "Updates for QQ is available!";
"There is a new version of QQ %@ on official site, <a href='%@'>click here</a> to view more details about this version." = "QQ %@ is now available on the official website.Your current version is %@. Would you like to update it to the latest version?";
"There is a new version of QQ %@ on App Store, <a href='%@'>click here</a> to view more details about this version." = "There is a new version of QQ %@ on App Store, <a href='%@'>click here</a> to view more details about this version.";
"Don’t Remind me updates from Official Site (You could change this setting later in Preference)" = "Don’t remind me updates from Official site.\n(You can also find this setting in Preferences.)";
"Skip This Version" = "Skip This Version";
"Remind Me Later" = "Remind Me Later";
"Download Update" = "Download Update";
"A new version of QQ is available on App Store." = "A new version of QQ is available on App Store.";
"Can not apply settings" = "Can not apply settings";
"You should set at least one question in the list." = "You should set at least one question in the list.";
"Click to edit" = "Click to edit";
"Face Edit Tips" = "Emoticons";
"Custom Face Added" = "The emotion was successfully added to the group.";
"Custom Face Added Conform" = "OK";
"Time Remain" = "-Left:";
"Time Remain Max" = "23:59:59+";
"Transfer Speed" = "(%@/S)";
"has sent you a nudge." = "has sent you a nudge.";
"Integrated chat window" = "QQ Chat Window";

"New messages from $2" = "New messages from $2";
"New messages from $2,$3" = "New messages from $2,$3";
"New messages from $2,$3,$4..." = "New messages from $2,$3,$4...";

"AudioClose" = "Audio chat end";
"Audio_Transmission" = "TIMING";
"Audio_Connecting" = "Waiting for the reply\n";
"Audio_Connecting_ReceiveAccept" = "Connecting,Please wait";
"Audio_Waiting for the reply" = "Connecting,Please wait";
"Audio Time out" = "Your contact is busy now";
"You have refused the audio chat request" = "You have refused the audio chat request";
"You are on the audio chat. Really want to quit it?" = "You are on the audio chat. Really want to quit it?";
"Buddy come from %@ %@" = " %@ %@";
"Emoticon" = "[Emoticon]";
"Image" = "[img]";
"File" = "File";
"Sound" = "[Sound]";
"As your group member list is full, you can't add any more contacts." = "As your group member list is full, you can't add any more contacts.";
"You are Offline" = "You are offline, please retry after signing in.";
"Offline title" = "Can not apply settings";
"Group name can not be empty." = "Group name can not be empty.";
"You have %u messages unread. Sure to quit?" = "You have %u messages unread. Sure to quit?";
"remind_view_eg_mouseover.png" = "remind_view_eg_mouseover";
"remind_ignore_eg_mouseover.png" = "remind_ignore_eg_mouseover";
"remind_view_eg.png" = "remind_view_eg";
"remind_ignore_eg.png" = "remind_ignore_eg";
"reshake_nor.png" = "reshake_nor_en";
"reshake_prs.png" = "reshake_prs_en";
"reshake_hov.png" = "reshake_hov_en";
"floatbox_button_mousedown_accept.png" = "floatbox_button_mousedown_accept_en";
"floatbox_button_mouseover_accept.png" = "floatbox_button_mouseover_accept_en";
"floatbox_button_normal_accept.png" = "floatbox_button_normal_accept_en";
"floatbox_button_mousedown_reject.png" = "floatbox_button_mousedown_reject_en";
"floatbox_button_mouseover_reject.png" = "floatbox_button_mouseover_reject_en";
"floatbox_button_normal_reject.png" = "floatbox_button_normal_reject_en";
"Failed to connect video call: the current version of the contact is out-of-date" = "Connection refused: The contact is using a deprecated version.";
"cf picture oversize check" = "The image contained in the message is over 5M. Please send it as a file";
"Call main panel" = "Contacts List";
"No unread msg number" = "No unread messages";
"Unread msg number" = " incoming chats";
"Single unread msg number" = " incoming chat";
"QQ Status" = "Status";
"QQ Status Online" = "Online";
"QQ Status Busy" = "Busy";
"QQ Status Away" = "Away";
"QQ Status Invisible" = "Invisible";
"QQ Status Offline" = "Offline";

"Locale Identifier" = "en_US";
"typing" = "typing";

"Don't show this again" = "Don't show this again";

"Failed to add" = "Failed to add";
"Evaluation copy" = "Evaluation copy";
"Continue" = "Continue";
"Send" = "Send";
"Folder tranfer error Tips" = "There may be failure to send some of your files，because of the following reasons，please confirm whether to continue sending.";
"Screen Capture Guid" = "Drag to share part of the screen (Esc to escape)";
"Folder tranfer error msg" = "There are failure to send your files, because of the following reasons.";
"Folder tranfer error msg remind" = "As the network and other reasons, part of the file transfer fails, ";
"Installation path error" = "The path to QQ contains illegal characters, which will prevents QQ from starting. Please move QQ into the recommended Application directory.";
"Click to view details" = "Click to view details";
"Click Details" = "Details";
"Screen Capture Guid FontName" = "Lucida Grande";
"Screen Capture Start Button Image Name" = "ScreenCapture_StartButton_English";
"Screen Capture Start Button Image Name1" = "ScreenCapture_StartButton1_English";

"All Contacts" = "All Contacts";
"NFC Contacts" = "NFC Contacts";
"All Chat" = "All Chat";
"Poly Chat" = "Group/Discussion";
"All TempChat" = "All Chat";
"Discussion" = "Discussion";
"NFC Discussion" = "NFC Discussion";
"System Message" = "System Message";
"Buddy Validate Message" = "Validation";
"Group System Message" = "Group System Message";
"Validate Message" = "Validation";
"View all Messages" = "View all Messages";
"Clear Messages" = "Clear Messages";
"Clear Buddy Validation" = "Clear Validation";
"Are you sure to clear all the validations" = "\nAre you sure to clear all the validations?";
"Clear Group System Message" = "Clear Group System Message";
"Are you sure to clear all the group system messages" = "\nAre you sure to clear all the group system messages?";
"No Messages" = "No Messages";

"Remove Selected Msg" = "Delete Selected Messages";
"Select All" = "Select All";
"Recent Week" = "Past Week";
"Recent Three Months" = "Past Three Months";
"Recent Year" = "Past Year";
"Recent All" = "All";
"Search Count" = "Found %u Messages";
"Delete Buddy Msg" = "Delete Message History";
"Delete Group Msg" = "Delete Group Messages";
"Delete Group SysMsg" = "Delete This System Message";
"Delete Discuss Msg" = "Delete Discuss Messages";
"Delete Mix Msg" = "Delete Messages";
"Send Instant Msg" = "Send Messages";
"Watch the Details" = "View Profile";
"Watch the SysMsg" = "View";

"Search" = "Search";
"Search Menu" = "Search Menu";
"No recent searches" = "No Recent Searches";
"Recents" = "Recents";
"Clear Search History" = "Clear Search History";
"Search Your Msg" = "Search Messages";

"Favourite" = "Favourite";
"Create Discussion Groups" = "Create Discussion Groups";
"Show in finder" = "Show in finder";

"Su" = "Su";
"Mo" = "Mo";
"Tu" = "Tu";
"We" = "We";
"Th" = "Th";
"Fr" = "Fr";
"Sa" = "Sa";
"January" = "January";
"February" = "February";
"March" = "March";
"April" = "April";
"May" = "May";
"June" = "June";
"July" = "July";
"August" = "August";
"September" = "September";
"October" = "October";
"November" = "November";
"December" = "December";

"File_All" = "show all items";
"File_Sent" = "show sent items";
"File_Accepted" = "show received items";
"File_Sending" = "show transferring items";
"File_Unfinished" = "show suspended items";
"m_fileFrom" = "From:  ";
"m_fileTo" = "To:  ";
"m_fileReceived" = "Receive:";
"m_fileSend" = "Send:";
"filePanel_Open" = "Open";
"filePanel_ManyOpen" = "Open";
"filePanel_Finder" = "Show in finder";
"filePanel_Stop" = "Stop";
"filePanel_Cancel" = "Remove from list";
"file_clean" = "clean";
"file_clean_all" = "Clean all";
"file_list" = "filter";
"You may not quit QQ when filesAndVideo are transferring." = "Your file transfer and video/voice call is still ongoing, are you sure to exit?";
"ServerTime_Panel Format" = "%b %e, %Y";
"tmp_Dialogue_Alert" = "You can transfer the folder only to your friend";
"暂不支持向我的设备发送文件夹" = "Sending folders is not supported yet";
"暂不支持发送文件夹，发送失败" = "Unable to send folder in discussion";
"文件夹有特殊字符" = "The file path contains \"\\\", failed to send";

"Sigh up" = "Sign up";
"Retrieve Password" = "Retrieve";
"Choose an account to log on" = "Choose an account to log on";
"输入帐号" = "Input Your QQ ID";
"输入密码" = "Password";

"Temporary session - from the discussion groups" = "From the discussion groups:%@ - Temporary Chat";
"Temporary session - from the groups" = "From the group:%@ - Temporary Chat";
"Temporary session - from paipai"   = "From paipai - Temporary Chat";
"Temporary session - from CRM"  =   "From bussiness QQ - Temporary Chat";
"Temporary session - from perWPA" = "From personal website - Temporary Chat";

"Selected folder will be failure QQ next time you start" = "Selected folder will be failure QQ next time you start";
"QQ can not be directly read and write the contents of the folder. If you select the folder, and then in the registry QQ can read and write to this folder. After restarting, you need to re-select the save file location." = "QQ can not be directly read and write the contents of the folder. If you select the folder, and then in the registry QQ can read and write to this folder. After restarting, you need to re-select the save file location.";
"Because of the limitations of the system security, QQ can not save the file in %@. Please re-select to save the file :" = "Because of the limitations of the system security, QQ can not save the file in %@. Please re-select to save the file :";

"Space" = "Space";
"Use old shortcut" = "Use old shortcut";
"Type shortcut" = "Type shortcut";
"Click to record shortcut" = "Click to record shortcut";
"Pad %@" = "Pad %@";
"The key combination %@ can't be used!" = "The key combination %@ can't be used!";
"The key combination \"%@\" can't be used because %@." = "The key combination \"%@\" can't be used because %@.";
"The key combination \"%@\" can't be used because it's already used by a system-wide keyboard shortcut. (If you really want to use this key combination, most shortcuts can be changed in the Keyboard & Mouse panel in System Preferences.)" = "The key combination \"%@\" can't be used because it's already used by a system-wide keyboard shortcut. (If you really want to use this key combination, most shortcuts can be changed in the Keyboard & Mouse panel in System Preferences.)";
"The key combination \"%@\" can't be used because it's already used by the menu item \"%@\"." = "The key combination \"%@\" can't be used because it's already used by the menu item \"%@\".";
"Command + " = "Command + ";
"Option + " = "Option + ";
"Shift + " = "Shift + ";
"Control + " = "Control + ";
"it has been forbidden" = "it has been forbidden";
"it is in conflict with other default hotkey" = "it is in conflict with other default hotkey";
"File transfer failed" = "file transfer failed";
"The other fefused to receive" = "The other refused to receive";
"The offline file has been received" = "The offline file has been received";
"Pull To Load History" = "Scroll down to load ealier conversation";
"Loading Over" = "All earlier conversations loaded\n";
"History Above" = "History Above";
"Clear the current search..." = "Clear the current search...";
"Can not find the matching search results..." = "No results...";
"Can not send picture contain special character" = "The picture contains special characters";
"Picture send failed for missing" = "The selected pictures cannot be sent. The picture may have been moved or deleted.";
"Picture send failed" = "Network error，the pictures cannot be sent.";

"Update Note" = "Update Notes:\n%@";
"InternalTestPrompt deadline" = "您使用的是内测版本，将于10月20日到期。届时请您前往QQ for Mac官网下载更加稳定、完善的正式版。";
"InternalTestPrompt will expire" = "感谢您使用QQ for Mac内测版进行体验测试，此版本将于%d天后过期，请您前往QQ for Mac官网下载更加稳定、完善的正式版。";
"InternalTestPrompt expired" = "感谢您使用QQ for Mac内测版进行体验测试，此版本已过期，请您前往QQ for Mac官网下载更加稳定、完善的正式版。";

"Has added" = "Added";
"face_defaultpic" = "face_defaultpic_Enligsh";
"Appear offline to this contact" = "Appear offline to this contact";
"Appear online to this contact" = "Appear online to this contact";
"NoneCameraAvailable" = "The camera device can not be detected, please reconfirm and try.";
"CameraOccupied" = "The camera device is occupied by other applications, please retry after closing the relevant app.";

"Add..." = "Add...";
"Profile_Discuss_Add" = "Add";
"Add custom emoticon" = "Add";
"Default" = "Default";
"Favourites" = "Favourites";
"Importing emoticon package..." = "Importing emoticon package...(%u/%u)";
"Exporting emoticon package..." = "Exporting emoticon package...(%u/%u)";
"Dividing emoticon package..." = "Dividing emoticon package, please wait...";
"Import emoticon package..." = "Import emoticon package...";
"Export selected emoticon package..." = "Export selected emoticon package...";
"Export all emoticon package..." = "Export all emoticon package...";
"Delete emoticon group prompt" = "Are you sure to delete selected group and all emoticons inside?";
"Delete emoticon group" = "Delete emoticon group";
"Add emoticon group error" = "Same group name already exists.";
"Delete emoticon" = "Delete emoticon";
"Delete emoticon prompt" = "Are you sure to delete selected emoticons？";
"Failed to import emoticon" = "Failed to import emoticon";
"Failed to export emoticon" = "Failed to export emoticon";
"The selected group has no emoticon inside" = "The selected group has no emoticon inside.";
"Failed to import emoticon with same emoticon" = "The emoticon has already existed.";
"Failed to import emoticon without login" = "Failed to import emoticon package when QQ is not running. Please make sure QQ is opened.";
"Failed to import emoticon with QQs" = "You are already logging in different QQ accounts, so please use Emoticon Manager to import package to corresponding account.";
"Failed to import emoticon with bad package" = "The emoticon package seems to be corrupted, Please check for consistency of the file.";
"ScreenCaptureTips" = "You can adjust the size and position of selected area.";
"Please verify independent password" = "Please verify independent password";
"You have not synced all your friends roaming record" = "You have not Synchronized";
"%Y-%m-%d %H:%M:%S" = "%Y-%m-%d %H:%M:%S";
"You set the number of roaming friend reached the upper limit vip%d, adjusted to %d below and continue to set" = "You set the number of roaming friend reached the upper limit vip%d, adjusted to %d below and continue to set";
"Do you confirm the deletion of the message" = "Are you sure to delete the selected message history?";
"You are not yet open for the first time chats roaming settings, click OK to open the roaming settings" = "Click OK to initialize the synchronization settings";
"sandbox text1" = "For safety, please reset your destination address for file saving, otherwise it can't save to disk normally.";
"sandbox text2" = "For safety, system restricts the range of destination address for file saving, since current system verison is %d%d.%d.%d. Your address has been modified as below:";
"sandbox text3" = "If you want to customize file saving address, please update system to 10.7.3 or above. Click here to go to Official Website to download update package.";
"sandbox text3 Click here" = "Click here";
"Permit access" = "Permit access";
"Downloads" = "Downloads";
"Pictures" = "Pictures";
"You can't set this address for saving files." = "You can't set this address for saving files.";
"The address is system address. It can't set for file-saving." = "The address is system address. It can't set for file-saving.";
"The symbolic link is " = "The link need to be authorized ";
"We've detected that a soft link to QQ localfile folder exists somewhere else. Please press the button below to authorize the link, and update your system software in time." = "We've detected that a soft link to QQ localfile folder exists somewhere else. Please press the button below to authorize the link, and update your system software in time.";

"Server Login IP Not Used" = "No advanced options";
"Server Login Type UDP" = "UDP";
"Server Login Type TCP" = "TCP";
"Press Space to speak" = "Press Space to speak";

"Send Audio Message Failed" = "此条语音消息发送失败。";
"Receive Audio Message Failed" = "对方于%@发送的语音消息接收失败。\n";
"Listen Again" = "重听";
"Send Again" = "重新发送";

"airPictureTips" = "Your QQ for iPhone is online, now you can\nselect photo from iPhone to send.";
"AirPicRequestSend" = "Please open the push notification you’ve received on iPhone, choose the photo to send.\nIf you don't receive the notification, please open your iPhone QQ to continue.\n(It would be better and faster to keep both your Mac and iPhone on same wi-fi network.)";
"AirPicMenuLocal" = "From Local";
"AirPicMenuiPhone" = "From iPhone Photo";


"ValidateMsg_AdditionalInfo_Prefix" = "Additional Message: ";
"ValidateMsg_AddBuddyToFolderLabel_Title" = "Add to group";
"ValidateMsg_AddBuddyToRemarkLabel_Title" = "Display name";
"GroupSysMsg_SenderLabel_Invite_Title" = "Inviter";
"GroupSysMsg_SenderLabel_Handle_Title" = "Manager";

"ValidateMsgEvent_OtherRequest" = "%@ requests to add you as a contact";
"ValidateMsgEvent_BeAdded" = "%@ has added you to his/her contact list";
"ValidateMsgEvent_BeAddBuddy_ServerResult_Fail" = "Failed to add %@ as a contact";
"ValidateMsgEvent_BeAccepted" = "%@ has accepted your request";
"ValidateMsgEvent_BeAcceptedAndBeAdded" = "%@ has added you to his/her contact list";
"ValidateMsgEvent_BeRefused" = "%@ has declined your request";
"ValidateMsgEvent_ChatFail" = "You can’t chat with him/her, because he/she is not your contact";
"GroupSysMsgEvent_NewGroup" = "You have successfully created the Group %@";
"GroupSysMsgEvent_RequireJoin" = "%@ has asked to join the Group %@";
"GroupSysMsgEvent_InviteBuddy" = "Your contact invites you to join in the Group %@";
"GroupSysMsgEvent_AcceptJoin" = "%@ has accepted your request to join the group";
"GroupSysMsgEvent_UserAcceptInvite" = "%@ agreed to join the Group %@";
"GroupSysMsgEvent_DenyJoin" = "%@ has declined your request to join the group";
"GroupSysMsgEvent_UserDenyInvite" = "%@ declined to join the Group %@";
"GroupSysMsgEvent_Dismiss" = "The owner of the group %@ has disbanded the group";
"GroupSysMsgEvent_MemberExit" = "%@ has quit the Group %@";
"GroupSysMsgEvent_KickoutMember_ToSelf" = "%@ has removed you from the Group";
"GroupSysMsgEvent_KickoutMember_ToOther" = "%@ has removed %@ from the Group";
"GroupSysMsgEvent_CreatorChange_FromSelf" = "You have transferred the Group %@ to %@";
"GroupSysMsgEvent_CreatorChange_FromOther" = "The owner of the Group %@ has transferred the group to %@";
"GroupSysMsgEvent_SetNormalManager_ToSelf" = "%@ has set you as the administrator of the Group";
"GroupSysMsgEvent_SetNormalManager_ToOther" = "%@ has set %@ as the administrator of the Group";
"GroupSysMsgEvent_CancelNormalManager_ToSelf" = "%@ has cancelled your administrator title";
"GroupSysMsgEvent_CancelNormalManager_ToOther" = "%@ has cancelled %@'s administrator title";
"GroupSysMsgEvent_ChatFail" = "You can’t initiate this conversation";
"GroupSysMsgEvent_BuddyJoined" = "%@ has joined the Group";

"SysMsgItem_tooltip_accept" = "Accept";
"SysMsgItem_tooltip_accepted" = "Accepted";
"SysMsgItem_tooltip_refuse" = "Decline";
"SysMsgItem_tooltip_refused" = "Declined";
"SysMsgItem_tooltip_ignore" = "Ignore";
"SysMsgItem_tooltip_ignored" = "Ignored";
"SysMsgItem_tooltip_shield" = "Block";
"SysMsgItem_tooltip_shielded" = "Blocked";
"SysMsgItem_tooltip_chat" = "Chat";
"SysMsgItem_tooltip_addFriend" = "Add";

"SysMsgMainTips" = "You can find the unprocessed\nmessages here";

"FileBox_WindowTitle"       = "FileBox";

"FileBoxUserGuide"          = "All successfully transferred \nfiles are kept inside the File Box.";
"FileBox_Today"             = "Today";
"FileBox_Yesterday"         = "Yesterday";
"FileBox_Previous 7 Days"   = "Previous 7 Days";
"FileBox_Previous 30 Days"  = "Previous 30 Days";
"FileBox_Earlier"           = "Earlier";

"FileBox_File missing title"= "File dose not exist";
"FileBox_File missing note" = "The file has been deleted, or been moved to other location.";
"FileBox_OK button"         = "OK";

"FileBox_Tips From"         = "From: ";
"FileBox_Tips To"           = "To: ";

"FileBox_Header Size"               = "Size";
"FileBox_Header LastTransmitted"    = "Last Transmitted";
"FileBox_Header Date"               = "Date";

"FileBox_ContextMenu Open"          = "Open";
"FileBox_ContextMenu ShowInFinder"  = "Show in Finder";
"FileBox_ContextMenu Remove"        = "Remove from FileBox";
"Continue Transfer" = "Wait for contiune transfer，The File received %@";
"Chat history in the conversion" = "Upgrading Data...";
"Chat history Finished" = "The data-upgrading succeeded.";
"menubar_openNFC" = "One Net";

"Feedback_Failed to send" = "Failed to send";
"Feedback_OK" = "OK";
"Feedback_Resend" = "Resend";
"Feedback_Send" = "Send";
"Feedback_Your feedback has not been sent yet, are you sure to quit?" = "Your feedback has not been sent yet, are you sure to quit?";
"Feedback_Sorry, may be due to network problems, your feedback sent failed, please try again!" = "Sorry, may be due to network problems, your feedback sent failed, please try again!";
"Feedback_Sending" = "Sending...";
"Feedback_Testing & Packing logs file" = "Testing & Packing logs file";
"Feedback_Uploading logs file" = "Uploading logs file";
"Feedback_Successfully sent, thank you for your feedback!" = "Successfully sent, thank you for your feedback!";
"Feedback_Select" = "-Select-";
"Feedback_Select Feedback Category" = "-Select-";

"Hitstory_firstTime" = "The data of QQ for Mac is upgrading.It will take %@ in your disk. You can use QQ normally during this time.";

"ChatFromOneNet" = "ChatFromOneNet";
"Histroy_Tran_Success" = "Your data files have been upgraded. Do you want to delete the old data,which is%fMB。";
"Histroy_Tran_Error" = "There is no enough space on the disk to continue upgrading.";
"Histroy_Tran_Success_Title" = "Data-upgrading succeded.";
"Histroy_Tran_Error_Title" = "The data-upgrading failed,error Code -%d";
"Discuss Offline Tips" = "You can't change discussion title while offline.";

"AntiFraud_Tips_1" = "涉及钱财务必警惕，请打电话或QQ视频通话核实好友身份。";
"AntiFraud_Tips_2" = "当前好友不在常用地登录QQ！请打电话或QQ视频通话确认对方身份。";
"AntiFraud_Tips_5" = "安全提示：如果聊天中收到对方发来链接要求您购卡充值，请一定先QQ视频通话核实好友身份及网站安全性。";
"AntiFraud_Tips_6" = "安全提示：为保护您和好友的帐号安全，如果聊天过程中有涉及好友辅助申诉的操作，请先QQ视频通话核实对方的真实身份。";
"AntiFraud_Tips_7" = "安全提示：如果聊天中有涉及告诉他人自己帐号密码的操作，请一定先QQ视频通话核实好友身份。";
"AntiFraud_Tips_8" = "警惕：和您聊天的可能不是好友本人！请打电话或QQ视频通话确认好友号码是否被盗。";

"Batch Group Title" = "Group Message Settings";
"Exit Batch Group" = "Back";
"Begin Batch Group" = "Batch Settings";

// 通知中心
// - 文件传输
"文件传输" = "File Transfer";
"文件传输失败" = "File transfer failed";
"拒绝接收文件" = "Declined to receive the file";
"已成功接收离线文件" = "Has received the offline file";
// - 其他
"快速回复" = "Quick reply";

"Try Use Swiftly Tip" = "试试输入：联系人、程序、天气、股票...";
"Swiftly Discuss Detail" = "%@、%@等%d人";
"unused plugins" = "Unused plugins";
"used plugins" = "Used plugins";
"Swiftly_Preference_Disable" = "Disable";
"Swiftly_Preference_Enable" = "Enable";
"Swiftly_MainWindow_Guide_1" = "Try searching a contact here~";
"Swiftly_MainWindow_Guide_2" = "Try using Swiftly to open local Apps";
"Swiftly_MainWindow_Guide_3" = "Typing city name to get real-time weather~";
"Swiftly_MainWindow_Guide_4" = "It’s easy to search and collect stock in Swiftly";
"Swiftly_MainWindow_Guide_5" = "Just enjoy Swiftly ：）";
"lang" = "en";

"launch Session" = "OK";
"Clear All" = "Clear All";

"Remember Password" = "Remember";
"Auto Login" = "Auto Login";

"replied Weibo" = " replied your Weibo";
"comment Weibo" = " replied your Weibo";
"reposted Weibo" = " reposted your Weibo";
"mentioned Weibo" = " mentioned you in Weibo";
"private Weibo" = " sent you a private message";
"update Weibo" = "Your Weibo have new message";

"ignore" = "ignore";
"All messages are already read" = "All messages are already read";
"QQ Group" = "Group";

"msgtable_ignore_down" = "msgtable_ignore_down";

"View More Records" = "More records into the Message Manager View";

// AIO 右键菜单
"直接发送" = "Send Files";
"发送离线文件" = "Send Offline Files";
"打开文件助手" = "Open File Assistant";

// 最近会话列表右键菜单
// common
"取消置顶" = "Unpin to top";
"置顶" = "Pin to top";

"在联系人中查看" = "Show in Contacts";
"移除该会话" = "Delete Chat";

// buddy
"查看资料" = "View Profile";
"发送邮件" = "Send Email";
"访问QQ空间" = "Visit Buddy Q-Zone";
"添加组" = "Add A new Folder";
"仅显示在线联系人" = "Show Online Contacts Only";
"删除该组" = "Delete This Folder";
"重命名该组" = "Rename";
"影音交谈" = "Video and Voice Chat";
"开始视频会话" = "Video Chat";
"开始语音会话" = "Audio Chat";
"移动联系人至" = "Move Contact to";

// group
"查看群资料" = "View Group info";
"发送群消息" = "Send Group Messages";
"发送群邮件" = "Send Group Email";
"群消息设置" = "Group Message Settings";
"接收并提醒消息" = "Receive Notifications";
"接收但不提醒消息" = "Don't show Notifications";
"收入群助手且不提醒" = "Show Message Count";
"不接收任何消息" = "Block Messages";
"群消息设置" = "Group Message Settings";
"创建群" = "Create Group";
"刷新群列表" = "Update Group List";
"创建讨论组" = "Create Discussion Group";
"添加群分组" = "Add A New Group Folder";
"移动群至" = "Move This Group to";
"成员管理" = "Manage Members";
"退出该群" = "Quit This Group";

"TipGroupMsgReceiveNormal" = "Receive Notifications enabled (only you can see this)";
"TipGroupMsgNoAlert" = "Don't show Notifications enabled (only you can see this)";
"TipGroupMsgAssistant" = "Include in Group Assistant enabled (only you can see this)";
"TipGroupMsgBlock" = "Block Messages Assistant enabled (only you can see this)";

// temp
"加为好友" = "Add to Contacts";

// discuss
"讨论组更名" = "Change Discussion Title";
"更新讨论组信息" = "Refresh Discussion info";
"讨论组消息设置" = "Discussion Message Settings";
"接收并提示消息" = "Receive with Alert";
"接收不提示消息" = "Receive without Alert";
"发送讨论组消息" = "Send Discuss Messages";

// AIO
"发起会话" = "Send Messages";
"未选择会话提醒" = "No Chat Selected";
"版本内测提醒" = "QQ for Mac 3.2 Beta";
"aio_newMsg_remind" = "New";

//MenuBar底部中英文取不同字符串，勿删
"menuBar_txl_hover" = "menuBar_txl_hover_en";
"menuBar_yx_hover" = "menuBar_yx_hover_en";
"menuBar_kj_hover" = "menuBar_kj_hover_en";
"menuBar_wb_hover" = "menuBar_wb_hover_en";
"menuBar_ss_hover" = "menuBar_ss_hover";//这个不变

"About Panel Close Licence" = "Close";
"About Panel Title" = "About";

"Launch Swiftly" = "Launch Swiftly";
"Right Click for more features" = "Click on the right side";
"Click here to show Contacts List" = "Open Contacts";

// 图片缓存清理
"TemporaryFile_scan_info" = "Scanned %d files，size is %0.1fMB";
"Scanning temporary files has finished" = "Scanning completed, Click to clean up";
"Scanning temporary files" = "Scanning in progress, Please wait...";
"Deleting temporary files" = "Clearup in progress, Please wait...";
"Clean up Temporary Pictures window" = "Clear Image Cache";
"Temporary Files From Buddy" = "from Contacts";
"Temporary Files From GroupNDiscuss" = "from Groups & Discussion";
"Clean up Temporary Files" = "Clear";
"Clean up Temporary Files Completed" = "Cleanup completed";
"TemporaryFile_delete_info" = "Saved %0.1fMB disk space for you";
"Title of cleanup temporary files box" = "Image Cache";
"Are you sure Quit Temporaryfile manager" = "Cleanup in progress，are you sure to quit?";
"Quit Temporaryfile manager" = "Quit Cleanup";
"Open image cache directory" = "View";

// 讨论组系统消息
"DiscussSysMsg_You" = "You";
"DiscussSysMsg_you" = "you";
"DiscussSysMsg_From" = "通过群";
"DiscussSysMsg_More" = " and other friends";
"DiscussSysMsg_JoinTalk" = "参与讨论";
"DiscussSysMsg_Invite" = " invited ";
"DiscussSysMsg_JoinDiscuss" = " to join in the discussion";
"DiscussSysMsg_RemoveMember_FMT" = "%@将%@移出讨论组";
"DiscussSysMsg_RemoveFromDiscussFMT" = "你被%@移出讨论组";
"DiscussSysMsg_ExitDiscuss" = " quit the discussion";
"DiscussSysMsg_ModifyDiscussTitle" = " changed the title of the discussion to ";

"CMD+W tips" = "Set ⌘W via \"Preferences\"－\"Chat window\"";
"Yesterday" = "Yesterday";
"New QQ Failed" = "Please restart the QQ and try again.";
"Warn Before Quit Hint" = "Press ⌘+Q again to quit";

"AddGroupMember %u Left" = "%u left";
"Are You Sure Left %@ Quit Group" = "Delete %@ from the group?";
"File Direction From" = "From";
"File Direction To" = "To";
"Recent Transmission Summary Info" = "There are %d new files to be received";

// 数据线
"My Device" = "My Device";
"My Phone" = "My Phone";
"My Pad" = "My Pad";
"暂不支持发送大于2G的文件" = "The file is bigger than 2G. Unable to be sent.";
"Click" = "Use ";
"Available Dataline Tip" = "Transfer files between devices";
"Available Dataline Tip Detail" = " to select files, or drag files here to send";
"Unsupported Device" = "暂不支持您的设备";
"Unsupported Device Detail" = "该功能暂时支持iPhone、Andriod、Windows Phone设备，敬请期待支持更多设备";
"Unknown Device" = "Please make sure：";
"Unknown Device Detail" = "1.Devices are listed as follows:\n   iPhone，iPad，Android，Windows\n2.You have login the latest version\n   of QQ on mobile device.";
"Need Update QQ" = "手机QQ版本过低";
"Need Update QQ Detail" = "请更新手机QQ版本以使用新功能";
"Send Update Complete" = "升级通知已送达";
"Send Update Complete Detail" = "升级通知已发送您的手机，请在手机上查看";

"FILE_TIPS_OF_REQUEST_TIMEOUT" = "Network error";
"FILE_TIPS_OF_REQUEST_DENIED" = "Sending offline file fail";
"FILE_TIPS_OF_NOSPACE" = "Disk is full";
"FILE_TIPS_OF_EXCEPTION" = "Exception occurred on file";
"FILE_TIPS_OF_OTHERERROR" = "Unknow error";
"FILE_TIPS_OF_CANCEL" = "Transfer cancelled";
"FILE_TIPS_OF_BECANCELLED" = "Transfer cancelled";
"FILE_TIPS_OF_REFUSE" = "Declined to receive";
"FILE_TIPS_OF_BEREFUSED" = "Contact declined to receive";
"FILE_TIPS_OF_SUC" = "Transfer complete";
"FILE_TIPS_BERECEIVE_BY_OTHER_DEVICE" = "Received on other device";
"FILE_TIPS_BEREFUSE_BY_OTHER_DEVICE" = "Refused on other device";
"FILE_TIPS_BECANCEL_AND_OFFLINE" = "Sending offline file...";
"FILE_TIPS_ON2OFF_UNKNOW_ERROR" = "Unknow error";
"FILE_TIPS_ON2OFF_UPLOAD_ERROR" = "Upload failed";

"AIO_TIPS offline file has been received" = "The offline file \"%@\" has been received";

"文件传输中" = "Transmit...";
"等待对方接收" = "Waiting for receiving...";
"发送中" = "Sending...";
"未知错误" = "Unknown error";

"当前传输" = "Current";
"最近文件" = "Recent files";
"全部接收" = "Accept all";
"全部" = "All";
"已发送" = "Sent only";
"已接收" = "Received only";


"Unable to send file" = "Unable to send file";
"File sent successfully" = "File sent successfully";
"File received successfully" = "File received successfully";
"Sending offline file..." = "Sending offline file...";
"Your default disk is full. Please change the directory or clear the disk and accept again." = "Your default disk is full. Please change the directory or clear the disk and accept again.";
"Save received files to" = "Save received files to";
"Other..." = "Other...";
"Details" = "Details";

"Unable to send file bigger than 4G." = "Unable to send file larger than 4G.";
"Discuss file larger than 4G." = "Unable to send file larget than 4G.";
"Unable to send file with 0 byte." = "The file is 0 bytes so it will not be sent.";

"%u files waiting for receiving" = "%u files waiting for receiving";
"File Assistant" = "File Assistant";
"No transmission" = "No transmission";
"View details in File Assistant" = "View details in File Assistant";
"QQ离线" = "QQ Offline";
"您尚有文件未传输完成，是否确认离线？" = "File transfer is not completed, are you sure to set offline?";
"The receive files directory does not exist, please reset" = "The receive files directory does not exist, please reset";

// 验证消息进AIO
"Validate_Type_Buddy_Request" = "好友申请";

"%u days available" = "within %u days";
"The file has expired" = "The file has expired";
"The file doesn't exist" = "The file doesn't exist";

// 最近会话列表
"群助手" = "Group Assistant";
//应用入口页面
"Weather" = "Weather";
"Stock" = "Stock";
"Feedback" = "Feedback";
//大面板搜索结果
"Friend" = "Friend";
"Group" = "Group";
"Discuss" = "Discuss";
"Function" = "Function";
"Searched My Device" = "My Device";
"Searched My Mobile" = "My Mobile";
"Searched My Pad" = "My Pad";
"Send file and photo to Mobile" = "Send file and photo to Mobile";
"Send file and photo to Pad" = "Send file and photo to Pad";
"View the no-alert Groups" = "View the no-alert Groups";
"Buddy request and notice panel" = "Buddy request and notice panel";
"Group request and notice panel" = "Group request and notice panel";

"all members count" = "All %d person";

"NoSearchResult" = "No Result";
"AddContactTitle" = "No Result...";

"Add" = "Add: ";
"as Contact or Group" = " as Contact or Group";

//profile
"Q Age" = "Q Age";
"Personal Info" = "Info";
"Location" = "Location";
"hometown" = "hometown";

"Email" = "Email";
"Telephone" = "Telephone";
"Mobile" = "Mobile";
"School" = "School";
"Occupation" = "Occupation";
"Homepage" = "Homepage";
"Description" = "Description";
"Blood type" = "Blood type";
"Edit" = "Edit";
"Accomplish" = "Apply";
"Profile_发起会话" = "Send Messages";
"Display name" = "Display name";
"%@-type blood" = "%@";
"Animal %@" = "%@";
"Nickname" = "Nickname";

"Profile" = "Profile";
"Profile_Members" = "Members";
"Profile_Settings" = "Settings";
"Group Name" = "Group name";
"Owner&Administer" = "Owner&Administer";
"More" = "More";
"Bulletin" = "Bulletin";
"Group introduction" = "Info";
"Group Card" = "Name Card";
"Last Messages" = "Last Messages";
"添加群成员" = "  add member";
"编辑群公告" = "Edit Bulletin";
"GroupBulletinPlaceholderString1" = "None";
"GroupBulletinPlaceholderString2" = "None";

"Gender" = "Gender";
"Animal" = "Animal";
"Starsign" = "Starsign";
"Blood Type" = "Blood Type";
"Age" = "Age";
"Discussion Name" = "Discussion Name";
"Discussion Member" = "Discussion Member";
"%d years" = "%d years";
"QQ ID" = "QQ ID";
"我的群名片" = "My Group Card";
"Allow anyone to join the group" = "Allow anyone to join the group";
"Require identity verification to join the group" = "Require identity verification to join the group";
"No one can join the group" = "No one can join the group";
"Identity verification" = "Identity verification";
"收到来自该讨论组的消息时" = "When receive messages from this group";

"MemberCell Tip 修改群名片" = "change group name";
"MemberCell Tip 取消管理员" = "cancel admins";
"MemberCell Tip 设为管理员" = "add admins";
"MemberCell Tip 删除群成员" = "remove";
"MemberCell Tip 群主" = "owner";
"MemberCell Tip 管理员" = "admins";

// aio left bar
"会话" = "Chat";
"好友" = "Contacts";
"群&讨论组" = "Group&Discuss";

"邮箱" = "QQMail";
"空间" = "Q-Zone";
"应用入口" = "Application";

// 群助手
"返回" = "Back";

// aio 会话成员列表
"添加联系人" = "Add Buddy";
"从本群中移除" = "Remove From Group";

//MQEditTextBox 群资料卡里用
"MQEditTextBox_Cancel" = "Cancel";
"MQEditTextBox_Save" = "Save";

//群、讨论组成员列表
"CF_GROUPCOUNT_STATIC" = "Members";
"CF_DISCUSSCOUNT_STATIC" = "Members";

//谷歌地图URL格式
"QQ_TXTID_GOOGLEMAP_URL_FORMAT"="http://maps.google.com/maps?q=%lf,%lf&iwloc=A&hl=zh-CN";
"QQ_TXTID_GOOGLEMAP_URL_PREFIX"="我在这里，点击查看：";

"LoginPanel_TheSameAccount" = "This ID %@ is already signed in.";

"Safety tips" = "Safety tips";
"QQ_TXTID_Auth_failed_please_relogin" = "Auth failed, please relogin";
"QQ_TXTID_Auth_failed_IllegalApp" = "AppID Auth failed";

/*消息记录*/
"Menu_MSGMGR_SHOWALL" = "Display All";
"Menu_MSGMGR_SHOWMSG" = "Display Contacts/Groups with Message History Only";
"MSGMGR_PROMPT" = "Tips";
"MSGMGR_DATE" = "Date:";
"MSGMGR_VIEW" = "&View";
"MSGMGR_VIEWSYS" = "View";
"MSGMGR_NOMSG" = "No message history.";
"MSGMGR_VIEWMSG" = "View Message History";
"MSGMGR_REMOVEMSG" = "Are you sure you want to delete the entire message history of this selected $USER$?";
"MSGMGR_DELETEMSG" = "Are you sure you want to delete the selected message history?";
"MSGMGR_SELECTONEMSG" = "Please select a record first and then delete it.";
"MSGMGR_NODE_MOBILEUSER" = "Mobile Contacts";
"MSGMGR_NODE_STRANGER" = "Strangers";
"MSGMGR_NODE_FRIENDROOT" = "Contacts";
"MSGMGR_NODE_GROUPROOT" = "Groups";
"MSGMGR_NODE_GROUPROOTEX" = "Groups You Have Quit";
"MSGMGR_MARKINGMSG" = "Marketing Messages";
"MSGMGR_BROADCAST" = "Broadcast Messages";
"MSGMGR_VALIDATE" = "Validation Messages";
"MSGMGR_SYSMSG" = "System Info";
"MSGMGR_GROUPSYSMSG" = "Group Message";
"MSGMGR_GROUP" = "Group";
"MSGMGR_CURRENTSEL" = "Current Contact";
"MSGMGR_DISCUSS" = "Discussions";
"MSGMGR_DISCUSSX" = "This discussion group is deleted";
"MSGMGR_MOBILE1" = "Mobile Contacts";
"MSGMGR_LINKMAN" = "Contacts";
"MSGMGR_FOLDER" = "Group";
"MSGMGR_SECURITYSYSMSG" = "Security Center Messages";
"MSGMGR_SELECTITEM" = "Cannot support multiple objects mode. Please select a single one";
"MSGMGR_SELECTITEM_DELETE" = "Sorry, cannot delete multiple objects. Please select a single one";
"MSGMGR_MSGREC" = "Message History";
"MSGMGR_MSGFOLDER" = "List";
"MSGMGR_NOTHISMSG" = "The message does not exist.";
"MSGMGR_MSGOBJ" = "Message object";
"MSGMGR_ALL" = "All";
"MSGMGR_EXPORT1" = "&Export Message History";
"MSGMGR_IMPORT1" = "Import Message History";
"MSG_IMPORT_WAZARD" = "Import Tool";
"MSGMGR_SELECT_CODE" = "";
"CheckButton_Code1028" = "";
"CheckButton_Code2052" = "";
"MSGMGR_DELETE1" = "&Delete Message History";
"MSGMGR_REFERESH" = "&Refresh";
"Menu_MsgMgr_ContactInfo" = "&View Profile";
"Menu_MsgMgr_GroupInfo" = "&View Group Info";
"MSGMGR_CHAT" = "Send Message(&C)";
"MSGMGR_EXPORTMSG" = "Export message records";
"MSGMGR_FIND" = "Search";
"MSGMGR_FINDING" = "Searching...";
"MSGMGR_FINDINGNODE" = "Searching in $NODE$...";
"MSGMGR_EXPORTING" = "Exporting message records...";
"MSGMGR_IMPORTING" = "Importing message history…";
"MSGMGR_PLEASEINPUTWORD" = "You need to enter a keyword for your search.";
"MSGMGR_ERRORFORSEARH" = "Search parameter error";
"MSGMGR_EXPORTFILTER" = "Encrypted files (*.bak)|*.bak|Webpage (*.mht)|*.mht|Text files (*.txt)|*.txt||";
"MSGMGR_IMPORTFILTER" = "Encryption file(*.bak)|*.bak||";
"MSGMGR_Export" = "Export";
"MSGMGR_Import" = "Import";
"MSGMGR_ExportOrImport" = "Import & Export";
"MSGMGR_Delete" = "Delete";
"MSGMGR_Update" = "Refresh";
"MSGMGR_Addr" = "My contacts";
"MSGMGR_FindText" = "Keyword:";
"MSGMGR_FindArea" = "Search in:";
"MSGMGR_Search" = "Search";
"MSGMGR_Clear" = "Clear";
"MSGMGR_User" = "Contacts";
"MSGMGR_Account" = "ID";
"MSGMGR_LastTime" = "Last Message Received";
"MSGMGR_Page" = "";
"MSGMGR_Goto" = "Go to Page";
"MSGMGR_Other" = "Other";
"MSGMGR_BlackList" = "Blocked Contacts/Deleted Contacts";
"MSGMGR_TempSession" = "Chat";
"Group_GroupDeleted" = "Groups you quit";
"MSGMGR_Mobile" = "Mobile contacts";
"MSGMGR_ChatAtGroup" = "Message history with $GROUP$";
"MSGMGR_ChatWithUser" = "Message history with $USER$";
"MSGMGR_SearchResult" = "Found: $COUNT$ message(s)";
"MSGMGR_SearchNoResult" = "Not found...";
"MSGMGR_ImportOver" = "Import message records completed";
"Tips_MSGMGR_CurPage" = "Page: $PAGE$/$PAGES$";
"MSGMGR_NeedCorrectPage" = "Please enter a valid page.";
"MSGMGR_MsgType" = "Message Type";
"MSGMGR_MsgAbs" = "Message Brief";
"MSGMGR_MsgRevTime" = "Message received at";
/*消息记录 end*/

/*文件传输*/
"IDS_CONTACT_MENU" = "Send Files";
"CF_TRANSPORTFILE_TIP" = "Send Files";
"IDS_SENDFILE_TIP" = "Send file request:";
"IDS_SENDFILE_RECEIVE_TIP" = "Accept file request:";
"IDS_SENDFILE_TRANSFERING_TIP" = "Receive Files";
"IDS_SENDFILE_TRANSFERING_SENDING_TIP" = "Send File";
"IDS_SENDFILE_TIP_OFFLINE" = "Send offline file request:";
"IDS_SENDFILE_RECEIVE_TIP_OFFLINE" = "Accept offline file request:";
"IDS_SENDFILE_TRANSFERING_TIP_OFFLINE" = "Receive offline file";
"IDS_SENDFILE_TRANSFERING_SENDING_TIP_OFFLINE" = "Send offline file:";
"IDS_SENDFILE_RERECEIVE" = "Save As";
"IDS_SENDFILE_CONTINUE_RECEIVE" = "Resume";
"IDS_SENDFILE_RECEIVE" = "Accept";
"IDS_SENDFILE_SAVEAS" = "Save As";
"IDS_SENDFILE_REFUSE" = "Decline";
"IDS_SENDFILE_CANCEL" = "Cancel";
"IDS_SENDFILE_RECVNEXTTIME" = "Accept Next Time";
"IDS_SENDFILE_SENDOFFLINEFILE" = "Send Offline File";
"IDS_SENDFILE_TRANSFERSPEED" = "Speed: 0KB/S";
"IDS_SENDFILE_TRANSFERING_TRANSFERSPEED" = "Speed: $SPEED$/S";
"IDS_SENDFILE_EXPIRETIME_OFFLINE" = "(Expires on $DATE$)";
"IDS_SENDFILE_EXPIRETODAY_HOUR_OFFLINE" = "(Storage expires in $TIME$ hours)";
"IDS_SENDFILE_EXPIRETODAY_MINUTE_OFFLINE" = "(Storage expires in $TIME$ minutes)";
"IDS_SENDFILE_BEACCEPT_BLUEBAR" = "The contact has accepted your request. Start sending files now.";
"IDS_SENDFILE_RECEIVE_BLUEBAR" = "You have accepted the contact's request. Start receiving files now.";
"IDS_SENDFILE_BEREQUEST_BLUEBAR_TIP" = "The contact requested to send .";
"IDS_SENDFILE_BEREQUEST_BLUEBAR_TIP_OFFLINE" = "The contact has sent you the offline file.";
"IDS_SENDFILE_BEREQUEST_TIP_OPER" = "is sending the following file:";
"IDS_SENDFILE_BEREQUEST_TIP_OPER_OFFLINE" = "has sent you an offline file";
"IDS_SENDFILE_TIP_CANCELSEND" = "Cancel";
"IDS_SENDFILE_TIP_CANCELSENDING" = "Stop";
"IDS_SENDFILE_TIP_SENDOFFLINE" = "Upload file to the QQ server. Your contact will be notified to receive it when they sign in.";
"IDS_SENDFILE_TIP_CANCELSEND_OFFLINE" = "Cancel";
"IDS_SENDFILE_TIP_CANCELSENDING_OFFLINE" = "Cancel";
"IDS_SENDFILE_TIP_RECV" = "Save to $PATH$";
"IDS_SENDFILE_TIP_CONTINUERECV" = "Resume unfinished file transfer";
"IDS_SENDFILE_TIP_SAVEAS" = "Select the save directory";
"IDS_SENDFILE_TIP_CONTINUESAVEAS" = "Customize the save directory of the file and receive again";
"IDS_SENDFILE_TIP_REFUSE" = "Decline to receive";
"IDS_SENDFILE_TIP_CANCELRECVING" = "Stop receiving";
"IDS_SENDFILE_TIP_REFUSE_OFFLINE" = "Decline to receive the offline file. Do not ask me again.";
"IDS_SENDFILE_TIP_CANCELRECVING_OFFLINE" = "Cancel the current transfer and ask me again next time I sign in to QQ.";
"IDS_SENDFILE_TIP_RECVNEXTTIME_OFFLINE" = "Cancel the current transfer and ask me again next time I sign in to QQ.";
"IDS_SENDFILE_RECEIVE_SUCC" = "File received, $C_TIME$";
"IDS_SENDFILE_RECEIVE_SUCC_OFFLINE" = "The offline file has been received.$C_TIME$";
"IDS_SENDFILE_SEND_SUCC_OFFLINE" = "The offline file has been received.$C_TIME$";
"IDS_SENDFILE_OPEN_FILE" = "Open the file";
"IDS_SENDFILE_OPEN_FOLDER" = "Open the containing folder";
"IDS_SENDFOLDER_OPEN_FILE" = "Open the folder";
"IDS_SENDFILE_BEFEFUSED_TIP" = "The contact declined to receive . The file has not been sent.$C_TIME$";
"IDS_SENDFILE_REFUSE_MSG_TIP" = "You declined to receive. The file has not been received.$C_TIME$";
"IDS_SENDFILE_SEND_SUCC" = "Success to send file ,$C_TIME$";
"IDS_SENDFILE_RECEIVE_TARGET_CANCEL" = "$UIN$ canceled sending \"$FILE$\". $TRANSIZE$ of $SIZE$ has been received successfully.$C_TIME$";
"IDS_SENDFILE_SENDING_TARGET_CANCEL" = "$UIN$ canceled receiving \"$FILE$\". $TRANSIZE$ of $SIZE$ has been sent successfully.$C_TIME$";
"IDS_SENDFILE_RECEIVE_TARGET_BROKEN_OFFLINE" = "Network error while receiving the offline file \"$FILE$\". $TRANSIZE$ of $SIZE$ has been received successfully.";
"IDS_SENDFILE_SENDING_TARGET_BROKEN_OFFLINE" = "Network error while sending the offline file \"$FILE$\". $TRANSIZE$ of $SIZE$ has been sent successfully.";
"IDS_SENDFILE_SENDING_SELF_CANCEL" = "Sending the file \"$FILE$\" was unexpectedly terminated. $TRANSIZE$ of $SIZE$ has been sent successfully. $C_TIME$";
"IDS_SENDFILE_RECVING_SELF_CANCEL" = "You canceled receiving the offline file \"$FILE$\". $TRANSIZE$ of $SIZE$ has been received successfully. $C_TIME$";
"IDS_SENDFILE_SENDING_CONTINUE_NEXTTIME_OFFLINE" = "QQ will resume sending this file when you resend.";
"IDS_SENDFILE_SENDING_SELF_CANCEL_OFFLINE" = "Sending the file \"$FILE$\" offline was unexpectedly terminated. $TRANSIZE$ of $SIZE$ has been sent successfully. $C_TIME$";
"IDS_SENDFILE_RECVING_SELF_CANCEL_OFFLINE" = "You canceled receiving the offline file . $TRANSIZE$ of $SIZE$ has been sent successfully. $C_TIME$";
"IDS_SENDFILE_RECVING_NET_ERROR" = "Connection failure. Receiving was canceled. $TRANSIZE$ of $SIZE$ has been received successfully.";
"IDS_SENDFILE_SENDING_NET_ERROR" = "Connection failure. Sending was canceled. $TRANSIZE$ has been sent successfully.";
"IDS_SENDFILE_RECVING_UNKOWN_ERROR" = "Network and other reasons. Receiving was canceled. $TRANSIZE$ of $SIZE$ has been received successfully.";
"IDS_SENDFILE_SENDING_UNKOWN_ERROR" = "Network and other reasons. Sending was canceled. $TRANSIZE$ has been sent successfully.";
"IDS_SENDFILE_SENDING_SELF_CANCEL_RESEND" = "Resend";
"IDS_SENDFILE_SENDING_SELF_CANCEL_RERECV" = "Receive Again";
"IDS_SENDFILE_RECEIVE_RECVNEXTIME" = "You cancelled receiving the offline file \"$FILE$\". The system will ask you next time you sign in.$C_TIME$";
"IDS_SENDFILE_BRREQUEST_BERECEIVE" = "You have received this file on other device";
"IDS_SENDFILE_BRREQUEST_BECANCEL" = "$UIN$ cancelled sending ,$TRANSIZE$ is received.$C_TIME$";
"IDS_SENDFILE_SELF_CANCEL_SEND" = "Sending the file was unexpectedly terminated. The file has not been sent.$C_TIME$";
"IDS_SENDFILE_RECVING_CONTINUE_REVEIVE" = "The contact has requested to send . $TRANSIZE$ has been received.";
"IDS_SENDFILE_RECVING_CONTINUE_REVEIVE_OFFLINE" = "The contact has sent you the offline file \"$FILE$\". $TRANSIZE$ of $SIZE$ has been received.";
"IDS_SENDFILE_AIO_OPEN_FAIL" = "Failed to open chat window.";
"IDS_SENDFILE_AIO_CANT_SEND_DIR" = "Sorry. Sending folders is not supported yet.";
"IDS_SENDFILE_HINT_TITLE" = "Tips";
"IDS_SENDFILE_SECURITY_SEE_MORE" = "Learn More";
"IDS_SENDFILE_SECURITY_SETTING" = "View Settings";
"IDS_SENDFILE_SECURITY_VIEW_MOREINFO" = "Learn More";
"IDS_SENDFILE_SECURITY_RENAME" = "Please remove \".$SUFFIX$\" from the file name and then open again.";
"IDS_FILETRANSFER_DEFAULT_DIR_TOOL_LONG" = "Folder name cannot exceed 200 characters.";
"IDS_FILETRANSFER_RENAME_FAIL" = "The file you were trying to send may be corrupted or in use by another program and thus was not sent.";
"IDS_SENDFILE_SENDING_SERVERREFUSE_OFFLINE" = "The server declined your request to send the offline file \"$FILE$\".";
"IDS_SENDFILE_RECVING_SERVERREFUSE_OFFLINE" = "The server declined your request to receive the offline file \"$FILE$\".";
"IDS_SENDFILE_TRANSFER_SERVERREFUSE_OFFLINE" = "The server declined your request to transfer the offline file \"$FILE$\".";
"IDS_SENDFILE_ONLINEFILE_NOTE" = "If the contact is taking too long to receive a file, you can try sending the file offline instead.";
"IDS_SENDFILE_SENDINGCOUNTTOOLARGE_OFFLINE" = "Sorry, you have selected more than 30 files. Please select again.";
"IDS_SENDFILE_ERROR_FILE_SIZE_ZERO" = "All the files in the folder are abnormal, or do not exist.";
"IDS_SENDFILE_ERROR_FILE_SIZE_TOO_BIG" = "The size of \"$FILE$\" is bigger than 4G. Unable to be sent.";
"IDS_SENDFILE_ERROR_FILE_SIZE_TOO_BIG_64G" = "The size of \"$FILE$\" is bigger than 64G. Unable to be sent.";
"IDS_SENDFILE_ERROR_FILE_OPEN_FAIL" = "The file you are trying to send appears to be in use. Please close the file and try again.";
"IDS_SENDFILE_ERROR_FILE_SEND_REPEAT" = "Sending file \"$FILE$\" is in progress. Please do not resend.";
"IDS_SENDFILE_ERROR_FILE_SEND_REPEAT_OFFLINE" = "Sending file \"$FILE$\" is in progress. Please do not resend.";
"IDS_SENDFILE_ERROR_NO_ENOUGH_SPACE" = "Disk is full. Please change the directory or clear the disk and accept again.";
"IDS_SENDFILE_ERROR_CONNECT_FAIL" = "Failed to transfer.";
"IDS_SENDFILE_ERROR_FILE_SEND_BEREFUSE" = "The contact declined to receive file \"$FILE$\".";
"IDS_SENDFILE_ERROR_OPENFILEFAIL" = "Open file \"$FILE$\" error.";
"IDS_SENDFILE_ERROR_UNKNOW" = "Failed to send file \"$FILE$\" . Unknown error.";
"IDS_SENDFILE_ERROR_SELF_OFFLINE" = "You can't send files when your status is Offline. Please switch to Online and try again.";
"IDS_SENDFILE_ERROR_FILE_NAME_TOO_LONG" = "Could not send file \"$FILE$\". The file name is too long.";
"IDS_SENDFILE_ERROR_DISC_NO_SPACE" = "Failed to receive. Disk \"$SPACE$\" is full.";
"IDS_SENDFILE_ERROR_REQUEST_TIMEOUT" = "Sending time out.";
"IDS_SENDFILE_ERROR_OPENFILEFAIL_REVC" = "Failed to open \"$FILE$\". File transfer stopped.";
"IDS_SENDFILE_ERROR_FILEEXCEPTION" = "Exception occurred in the operation on the file \"$FILE$\". File transfer stopped.";
"IDS_SENDFILE_ERROR_UN" = "Exception occurred while processing the file \"$FILE$\". File transfer stopped.";
"IDS_SENDFILE_ERROR_UNKNOW2" = "Failed to transfer \"$FILE$\". Unknown error occurred.";
"IDS_SENDFILE_FILE_NO_EXIST" = "The file cannot be found.";
"FILETRANS_ABORTIFCLOSE_AIOCLOSE" = "File transfer will be canceled if you close the window. Are you use you want to continue?";
"IDS_SENDFILE_ERROR_FILE_FULL_NAME_TOO_LONG" = "The full path of the file is too long. Failed to receive.";
"IDS_SENDFILE_TIMEDURATION_HOUR" = " hour(s)";
"IDS_SENDFILE_TIMEDURATION_MINUTE" = " minute(s)";
"IDS_SENDFILE_TIMEDURATION_SECOND" = " second(s)";
"IDS_SENDFILE_SEND_SUC_NOTE" = "The file was sent successfully in $TIME$ with an average speed of $SPEED$/sec.";
"IDS_SENDFILE_RECV_SUC_NOTE" = "The file was received successfully in $TIME$ with an average speed of $SPEED$/sec.";
"SETTING_FILETRANSFER_NAME" = "File Transfer";
"SETTING_FILETRANSFER_DEFAULT_DIR" = "Save received files in this folder:";
"SETTING_FILETRANSFER_CHANGE_DEFAULT_DIR" = "Browse";
"SETTING_FILETRANSFER_SERCURITY" = "Transfer Security";
"SETTING_FILETRANSFER_REFUSE_EXE_FILE" = "Block high-risk files (Except for a few common types)";
"SETTING_FILETRANSFER_RECEIVE_FILE" = "Receive all files, with executable files renamed automatically";
"SETTING_FILETRANSFER_REFUSE_FILE" = "Do not receive any files";
"SETTING_FILETRANSFER_SECURITY_HIGH" = "Security - High";
"SETTING_FILETRANSFER_SECURITY_MID" = "Security - Medium (Recommended)";
"SETTING_FILETRANSFER_SECURITY_LOW" = "Security - Low";
"SETTING_FILETRANSFER_SECURITY_FILE_HINT" = "What is risk of file?";
"SETTING_FILETRANSFER_SELECT_DEFAULT_DIR" = "Browse:";
"SafeLevel_Adjust" = "Set security level for file transfer.";
"Button_ChangeSafeAdjust" = "Edit Security Level";
"Safe_level" = "Security Level";
"SECURITYCENTER_RECV_REFUSE_PROMPT" = "The contact has tried to send you \"$FILE$\". The security center blocked it. It could be a security risk or caused by security settings.";
"SECURITYCENTER_SEND_REFUSE_PROMPT" = "\"$FILE$\" you sent is blocked by security center.";
"SECURITYCENTER_RECV_RENAME_PROMPT" = "The contact tried to send you \"$FILE$\". The security center has automatically renamed the file (add \"$RENAMESUFFIX$\" as a suffix).";
"SECURITYCENTER_RECV_RENAME_SUFFIX" = "Rename";
"SECURITYCENTER_RECV_OF_REFUSE_PROMPT" = "Your contact is trying to send you \"$FILE$\" when you are offline. Unfortunately, it has been blocked according to your security center settings.";
"SECURITYCENTER_RECV_OF_RENAME_PROMPT" = "Your contact is trying to send you \"$FILE$\" when you are offline. It has been automatically renamed. (Adding \".$RENAMESUFFIX$\" to the end of the file name.)";
"SECURITYCENTER_RECV_OF_DANGERTIP_PROMPT" = "Your contact is trying to send you \"$FILE$\" when you are offline. The file may contain security risks.";
"IDS_SENDFILE_Online" = "Send Files";
"IDS_SENDFILE_Offline" = "Send Offline Files";
"IDS_SENDFILE_Setting" = "File Transfer Settings";
"IDS_SENDFILE_Oper_Offline" = "Send Offline Files";
"IDS_SENDFILE_Recv_Default_Dir" = "This directory is invalid or read-only. Please choose another default directory for receiving files.";
"FOLDER_IDS_SENDFILE_SENDING_SELF_CANCEL_OFFLINE" = "Sending the folder \"$FILE$\" was unexpectedly terminated. $TRANSIZE$ of $SIZE$ has been sent successfully. $C_TIME$";
"FOLDER_IDS_SENDFILE_RECVING_SELF_CANCEL_OFFLINE" = "You canceled receiving the folder . The system will ask you next time you sign in. $C_TIME$";
"FOLDER_IDS_SENDFILE_SELF_CANCEL_SEND" = "Sending the folder was unexpectedly terminated. The folder has not been sent. $C_TIME$";
"FOLDER_IDS_SENDFILE_SENDING_SELF_CANCEL" = "Sending the folder \"$FILE$\" was unexpectedly terminated. $TRANSIZE$ of $SIZE$ has been sent successfully. $C_TIME$";
"FOLDER_IDS_SENDFILE_RECVING_SELF_CANCEL" = "You canceled receiving the folder \"$FILE$\". $TRANSIZE$ of $SIZE$ has been received successfully. $C_TIME$";
"FOLDER_IDS_SENDFILE_RECEIVE_TARGET_CANCEL" = "$UIN$ canceled sending \"$FILE$\". $TRANSIZE$ of $SIZE$ has been received successfully. $C_TIME$";
"FOLDER_IDS_SENDFILE_SENDING_TARGET_CANCEL" = "$UIN$ canceled receiving \"$FILE$\". $TRANSIZE$ of $SIZE$ has been sent successfully. $C_TIME$";
"FOLDER_IDS_SENDFILE_BRREQUEST_BECANCEL" = "$UIN$ cancelled file transfer,$TRANSIZE$ is received. $C_TIME$";
"FOLDER_IDS_SENDFILE_RECEIVE_SUCC" = "Folder received, $C_TIME$";
"FOLDER_IDS_SENDFILE_SEND_SUCC" = "Success to send folder , $C_TIME$";
"FOLDER_IDS_SENDFILE_BEFEFUSED_TIP" = "The contact declined to receive . $TRANSIZE$ is received. $C_TIME$";
"IDS_SENDFOLDER_SENDER_SECURITY_TIPS" = "As the other QQ / TM security settings, your folder transfer request was denied.";
"FOLDER_IDS_SENDFILE_REFUSE_MSG_TIP" = "You declined to receive. The folder has not been received. $C_TIME$";
"FOLDER_IDS_SENDFILE_RECEIVE_TOOBIG" = "You transfer files in a folder is too large, transmission failure.";
"FOLDER_IDS_SENDFILE_RECEIVE_TOOMANY" = "The number of folders is overmuch, transmission failure.";
"IDS_SENDFILE_ERROR_FOLDERNAMEERROR" = "The file or folder name contains special characters，failed to send.";
"IDS_SENDFILE_ERROR_FILENAMEERROR" = "The file name contains special characters，failed to send.";
"FOLDER_IDS_SENDFILE_MAXDEEPNUM" = "You transfer the folder exceeds the maximum number of layers，failed to send.";
"FOLDER_IDS_SENDFILE_OLDVERSION" = "Sorry, the other side of the QQ version does not support folder transfer.";
"FOLDER_IDS_SENDFILE_UNKNOWN" = "Unknown Error, transmission failure.";
"FOLDER_IDS_SENDFILE_RECVING_NET_ERROR" = "Connection failure. Receiving was canceled. $TRANSIZE$ of $SIZE$ has been received successfully.";
"FOLDER_IDS_SENDFILE_SENDING_NET_ERROR" = "Connection failure. Sending was canceled. $TRANSIZE$ has been sent successfully.";
"FOLDER_IDS_SENDFILE_RECVING_UNKOWN_ERROR" = "Network and other reasons. Receiving was canceled. $TRANSIZE$ of $SIZE$ has been received successfully.";
"FOLDER_IDS_SENDFILE_SENDING_UNKOWN_ERROR" = "Network and other reasons. Sending was canceled. $TRANSIZE$ has been sent successfully.";
"IDS_SENDFOLDER_SEND_FAIL" = "Security issue";
"IDS_SENDFOLDER_LOG_DONOTCARE" = "Unknown";
"IDS_SENDFOLDER_LOG_DUPLICATENAME" = "Duplicate file names";
"IDS_SENDFOLDER_LOG_UNUSUALCHAR" = "File name contains special characters";
"IDS_SENDFILE_ERROR_REASON_SECURITY_UNSAFEFILE" = "Unknown";
"IDS_SENDFILE_ERROR_REASON_SECURITY_RENAME" = "Unknown";
"IDS_SENDFILE_ERROR_REASON_EXCEED4G" = "Unknown";
"IDS_SENDFILE_ERROR_REASON_EXCEED64G" = "File over 64G";
"IDS_SENDFILE_ERROR_REASON_OPENFAIL" = "Unknown";
"IDS_SENDFILE_ERROR_REASON_INEXISTENCE" = "File does not exist";
"IDS_SENDFILE_ERROR_REASON_NAMELENEXCEED" = "File name exceeded";
"IDS_SENDFILE_ERROR_REASON_INVALIDNAME" = "Unknown";
"IDS_SENDFILE_ERROR_REASON_UNKNOWN" = "Network issue";
"IDS_SENDFILE_ERROR_FOLDERLONGERROR" = "File name is too long, failed to send.";
// alvenli 文件发送不支持的类型
"FILE_TRAN_NOT_SUPPORT_DIRECT" = "Direct sending file is not supported yet";
"FILE_TRAN_NOT_SUPPORT_FOLDER" = "Sending folder is not supported yet";
/*文件传输 end*/

"Start Discussion Group Audio" = "Start Discussion Group Audio";
"Start Discussion Group Video" = "Start Discussion Group Video";
"Start Discussion Group ScreenShare" = "Start Discussion Group ScreenShare";


"SYSTEM_PREFERENCE_OPEN" = "tell application \"System Preferences\" to activate \
\ntell application \"System Preferences\" to set current pane to pane id \"com.apple.preference.network\" \
\ntell application \"System Events\" to tell process \"System Preferences\" to tell window 1 \
\nclick button \"Advanced…\" \
\nclick radio button \"Proxies\" of tab group 1 of sheet 1 \
\nend tell";

"QQ_TXTID_网络连接不可用, 请稍后再试"="Network error.Try it later";
"QQ_TXTID_Client_parameter_error"="Client parameter error";


// Share contact
"Please select one share"  = "Please select one share";
"None selected"            = "None selected";
"Share to"                 = "Share to";
"Enter message here"       = "Enter message here";
